app/Controllers/Berita.php

UPDATE `tbl_news_category` SET `news_category` = 'EDUKASI'
WHERE `tbl_news_category`.`news_categoryid` IN ('10')
---
    public function update_kategori($news_categoryid = null)
    {
        $kategori = $this->KategoriModel->find($news_categoryid);
        $data = [
            'kategori' => $kategori,
            'news_category' => $this->request->getVar('news_category')
        ];
        $save = $this->KategoriModel->update($news_categoryid, $data);

DELETE FROM `tbl_news_category`
WHERE `news_categoryid` IN ('18')
---
    public function hapus_kategori($news_categoryid)
    {
        $kategori = $this->KategoriModel->find($news_categoryid);
        $this->KategoriModel->delete($news_categoryid);