app/Controllers/File.php

    public function new()
    {
        $file = $this->FileModel->findAll();
---
SELECT *
FROM `tbl_file`