app/Controllers/Kelurahan.php

SELECT *
FROM `tbl_kecamatan`
---
    public function index()
    {
        $kecamatan = $this->KecamatanModel->findAll();

DELETE FROM `tbl_kelurahan`
WHERE `kelurahanid` IN ('44')
---
    public function delete($kelurahanid = null)
    {
        $this->KelurahanModel->delete($kelurahanid);