app/Controllers/Kim.php

SELECT *
FROM `tbl_kecamatan`
SELECT *
FROM `tbl_kelurahan`
---
    public function index()
    {
        $kecamatan = $this->KecamatanModel->findAll();
        $kelurahan = $this->KelurahanModel->findAll();