app/Models/BeritaModel.php

    function getAll()
    {
        $builder = $this->db->table('tbl_news');
        $builder->select('*');
        $builder->join('tbl_news_category', 'tbl_news_category.news_categoryid = tbl_news.news_categoryid');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_news.userid');
        $builder->orderBy('tbl_news.newsid', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `tbl_news`
JOIN `tbl_news_category` ON `tbl_news_category`.`news_categoryid` = `tbl_news`.`news_categoryid`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_news`.`userid`