app/Models/FileModel.php

    function getAll()
    {
        $builder = $this->db->table('tbl_file');
        $builder->select('*');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_file.userid');
        $builder->orderBy('tbl_file.fileid', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `tbl_file`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_file`.`userid`
ORDER BY `tbl_file`.`fileid` DESC