app/Models/FolderfotoModel.php

SELECT *
FROM `tbl_folder_photo`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_folder_photo`.`userid`
ORDER BY `folder_photoid` DESC
---
    function getAll()
    {
        $builder = $this->db->table('tbl_folder_photo');
        $builder->select('*');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_folder_photo.userid');
        $builder->orderBy('tbl_folder_photo.folder_photoid', 'DESC');
        $query = $builder->get();