app/Models/FotoModel.php

    function getAll()
    {
        $builder = $this->db->table('tbl_photo');
        $builder->select('*');
        $builder->join('tbl_folder_photo', 'tbl_folder_photo.folder_photoid = tbl_photo.folder_photoid');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_photo.userid');
        $query = $builder->get();
---
SELECT *
FROM `tbl_photo`
JOIN `tbl_folder_photo` ON `tbl_folder_photo`.`folder_photoid` = `tbl_photo`.`folder_photoid`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_photo`.`userid`
WHERE `tbl_photo`.`folder_photoid` = '155'
ORDER BY `tbl_photo`.`photoid` DESC