app/Models/KelurahanModel.php

    function getAll()
    {
        $builder = $this->db->table('tbl_kelurahan');
        $builder->select('*');
        $builder->join('tbl_kecamatan', 'tbl_kecamatan.kecamatanid = tbl_kelurahan.kecamatanid');
        $builder->orderBy('tbl_kelurahan.kelurahanid', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `tbl_kelurahan`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`kecamatanid` = `tbl_kelurahan`.`kecamatanid`
ORDER BY `tbl_kelurahan`.`kelurahanid` DESC