app/Models/KimModel.php

SELECT *
FROM `tbl_kim`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`kecamatanid` = `tbl_kim`.`kecamatanid`
JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`kelurahanid` = `tbl_kim`.`kelurahanid`
ORDER BY `tbl_kim`.`kimid` DESC
---
    function getAll()
    {
        $builder = $this->db->table('tbl_kim');
        $builder->select('*');
        $builder->join('tbl_kecamatan', 'tbl_kecamatan.kecamatanid = tbl_kim.kecamatanid');
        $builder->join('tbl_kelurahan', 'tbl_kelurahan.kelurahanid = tbl_kim.kelurahanid');
        $builder->orderBy('tbl_kim.kimid', 'DESC');
        $query = $builder->get();