app/Models/LinkModel.php

SELECT *
FROM `tbl_link_terkait`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_link_terkait`.`userid`
ORDER BY `tbl_link_terkait`.`link_terkaitid` DESC
---
    function getAll()
    {
        $builder = $this->db->table('tbl_link_terkait');
        $builder->select('*');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_link_terkait.userid');
        $builder->orderBy('tbl_link_terkait.link_terkaitid', 'DESC');
        $query = $builder->get();