app/Models/PengumumanModel.php

    function getAll()
    {
        $builder = $this->db->table('tbl_notice');
        $builder->select('*');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_notice.userid');
        $builder->orderBy('tbl_notice.noticeid', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `tbl_notice`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_notice`.`userid`