app/Models/VideoModel.php

    function getAll()
    {
        $builder = $this->db->table('tbl_video');
        $builder->select('*');
        $builder->join('tbl_user', 'tbl_user.userid = tbl_video.userid');
        $builder->orderBy('tbl_video.videoid', 'DESC');
        $query = $builder->get();
---
SELECT *
FROM `tbl_video`
JOIN `tbl_user` ON `tbl_user`.`userid` = `tbl_video`.`userid`
ORDER BY `tbl_video`.`videoid` DESC